{
    "about_the_game": "<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Overview_Small.png?t=1702486813\" /><br><br>Welcome to <strong>Duels of Fortune</strong>, a fast-paced 2.5D fighting game featuring a crazy diverse cast of loveable characters with unique superpowers, and an open-ended, freeform gameplay style that lets you play the game your way. It provides a simple control scheme that makes the game accessible for beginners, while keeping plenty of mechanical and character-based depth for serious players to dig into.<br><br>From intense clashes against friends and rivals, to expansive singleplayer content, to heaps of character lore to read up on, there's something for everyone in Duels of Fortune!<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Features_Small.png?t=1702486813\" /><br>                                                                                                                                                                                  <br><ul class=\"bb_ul\"><li><strong>VERSUS MODE</strong> - Battle it out in traditional 1-on-1 duels!<br></li><li><strong>ARCADE MODE</strong> - Fight your way through a gauntlet of increasingly difficult opponents, culminating with a special boss fight!<br></li><li><strong>TRAINING MODE</strong> - Practice your skills using a customizable training dummy!<br></li><li><strong>MISSION MODE</strong> - Participate in numerous special fights that add unique challenges or conditions to spice up the match!<br></li><li><strong>BOSS FIGHTS</strong> - Easily rematch any of the unique and challenging bosses found throughout the game!<br></li><li><strong>COMBO TRIALS</strong> - Learn what each character can do by trying out increasingly tricky pre-made combos!<br></li><li><strong>STAGE HAZARDS</strong> - A toggleable feature that flips stages on their head with all sorts of crazy effects, including ring-out zones, throwable items, giant skeletons that attack you from the background, and MORE!!<br></li><li><strong>LORE JOURNAL</strong> - Read up on the lore and backstory of each character, and learn what they fight for!<br></li><li><strong>JUKEBOX </strong>- Jam out to the bangin' soundtrack composed by Jack7!<br></li><li>All with 15+ <strong>UNIQUE FIGHTERS</strong> to choose from, with many more on the way!</li></ul>                                                                                                                                                                                  <br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Mechanics_Small.png?t=1702486813\" /><br><br><ul class=\"bb_ul\"><li>Perform stylish and dynamic <strong>combos </strong>with an open-ended attack cancel system!<br></li><li>Build up your Super Meter to unleash powerful and cinematic <strong>Super Moves</strong>, or defend yourself in a pinch with invincible <strong>Reversal</strong> attacks!<br></li><li>Strategically use <strong>Break Burst</strong> to shut down your opponents' combos, or go all-in on your own combo with a well-timed <strong>Blast Burst</strong>!<br></li><li>Schmoove around the stage with a variety of <strong>mobility mechanics</strong>, including dashes, long jumps, airdashes, free air drifting, and tons of unique character-specific options!<br></li><li>Choose between <strong>two styles</strong> of blocking: button-based blocking, or back-to-block!<br></li><li>And on top of all that, explore each character's plethora of <strong>unique attributes</strong>, giving every one of them a completely distinct feel and style!</li></ul>                                                                                                                                                                                  <br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Characters_Small.png?t=1702486813\" /><br><br>What would a fighting game be without its fun and diverse cast of playable characters? Here's just a handful of the loveable (and despicable) fighters you can choose from!<br><br>‎<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Clyde_Small.png?t=1702486813\" /><br><br>Clyde is a boxing prodigy with an attitude, and one of the most renowned fighters in the world. Clyde doesn't need any weapons; his fists, his natural speed, and his ability to create fire from his hands are all he needs to put up a good fight!<br><br><ul class=\"bb_ul\"><li><strong>TRAILBLAZER</strong> - Rush in and overwhelm your opponents with Clyde's incredible speed and offensive capabilities!<br></li><li><strong>BRING THE HEAT </strong>- Clyde's special moves are focused on raw power and combo utility, delivering fiery punches left and right!<br></li><li><strong>KING OF THE RING</strong> - Keep your opponent on the ropes with fast mix-ups that force equally fast reactions!</li></ul>‎<br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Annie_Small.png?t=1702486813\" /><br><br>Annie is a young engineer with a big brain, and an even bigger heart. Using her powerful mechanical arm, her vast arsenal of gadgets, and her helpful robotic companion Gizmo, she holds her own even despite her lack of experience!<br><br><ul class=\"bb_ul\"><li><strong>GADGET GIRL </strong>- Annie's wide array of projectiles and traps let her set up an unbreakable defense, and she has the tools to easily convert her long-range zoning into close-up pressure!<br></li><li><strong>BLAST OFF</strong> - Annie's special rocket boots grant her a midair jump, as well as the ability to drastically slow her descent!<br></li><li><strong>HELPING HAND </strong>- Annie's Super Moves summon her little robo-buddy Gizmo to assist her in various ways, like firing massive lasers or carpet-bombing the whole stage!</li></ul><br>‎<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Rattlebone_Small.png?t=1702486813\" /><br><br>Long ago, Rattlebone was a royal knight who loyally served his kingdom, until one day he fell victim to a horrible trebuchet accident. Now, revived into the modern day in skeletal form, he continues to fight as honourably as ever with his trusty sword and shield!<br><br><ul class=\"bb_ul\"><li><strong>FOR HONOUR </strong>- An honest and noble fighter, Rattlebone is primarily focused on the absolute fundamentals of combat!<br></li><li><strong>RATTLE ME BONES</strong> - Rattlebone's skeletal form grants him plenty of new techniques, like throwing his own head as a bouncing projectile!<br></li><li><strong>CHIVALROUS SPIRIT</strong> - Unleash a powerful Super Move that imbues Rattlebone's sword with special properties for a limited time!</li></ul><br>‎<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Shoto_Small.png?t=1702486813\" /><br><br>Shoto is a young, yet highly skilled student of the Locks Dojo. While he may have the personality of a cardboard box, his powers of electricity and his unbreakable focus in combat make him a force to be reckoned with!<br><br><ul class=\"bb_ul\"><li><strong>GREASED LIGHTNING</strong>- Shoto's attacks are fast and precise, giving him a natural advantage in hand-to-hand combat!<br></li><li><strong>GLASS CANNON</strong> - Shoto may sport a low health pool, but he's got lots of ways to dish out far more damage in return!<br></li><li><strong>SHOTOKAN SPECIAL</strong> - With straightforward projectiles, a powerful uppercut, and a flurry of advancing kicks, Shoto remains true to his namesake while putting his own unique spin on the formula!</li></ul><br>‎<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Red_Small.png?t=1702486813\" /><br><br>A brash, delinquent punk from the Capital, Red's aggressive and brutish nature is reflected in his fighting style. Red aims to get in his opponent's face and stay there, relentlessly beating them down with his energy beam!<br><br><ul class=\"bb_ul\"><li><strong>BRUTE STRENGTH</strong> - Red is a powerful attacker who prefers to brute-force his way in, rather than relying on speed or zoning.<br></li><li><strong>UNYIELDING RAGE</strong> - Red's special Rage mechanic lets him unleash stronger versions of his special moves after taking or dealing enough damage!<br></li><li><strong>SMASHIN' KNEECAPS</strong> - Thanks to his many grappling attacks and deadly mix-ups, Red almost never has to let up his offense once he has the advantage!</li></ul>‎<br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Baron_Small.png?t=1702486813\" /><br><br>Often called the &quot;strongest man alive&quot;, Baron's overwhelming desire to fight strong opponents led him down a dark, bloody path that ended with a life sentence. Now set free again thanks to the manipulation of Sylvan Blackjack, his titanic strength and powerful grappling techniques will crush all who oppose him.<br><br><ul class=\"bb_ul\"><li><strong>WRESTLING LEGEND</strong> - Baron's mighty grappling moves can dish out damage like nothing else, and can even be comboed together under the right circumstances!<br></li><li><strong>UNBREAKABLE</strong> - With a huge HP pool and a variety of armoured attacks, Baron is both an unstoppable force, AND an immovable object!<br></li><li><strong>THE BIGGER THEY ARE...</strong> - Baron's great power comes at the cost of mobility. Use your techniques wisely to keep the opponent on the back foot and avoid getting overwhelmed!</li></ul>‎<br>‎<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Sylvan_Small.png?t=1702486813\" /><br><br>Sylvan is the founder and CEO of the Diamondeye Company, one of the largest and richest corporations in the world. Naturally, this can only mean that Sylvan is as sleazy and underhanded as they come, and he'll put all his chips down to get the job done.<br><br><ul class=\"bb_ul\"><li><strong>ACES HIGH</strong> - Sylvan revolves around his card drawing mechanic. The more Aces he draws using his card draw attacks, the more options he gains!<br></li><li><strong>FULL HOUSE</strong> - When Sylvan has all 4 aces, he enters a state called Full House mode, where he becomes the most powerful character in the game for a limited time!<br></li><li><strong>GOOD LUCK</strong> - It can take some time and luck to get to Full House mode, but tools like a slot machine that grants random effects, and your faithful bodyguard Mr. Withers, can help buy you some time.</li></ul><br>‎<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Shiverskull_Small.png?t=1702486813\" /><br><br>Once a feared high-seas pirate, Shiverskull is back from the dead to plunder the competition! With his twin swords and the help of his trusted pirate crew, he isn't afraid to take some serious risks to win. You can't kill what's already dead!<br><br><ul class=\"bb_ul\"><li><strong>AYE, MATEYS</strong> - Shiverskull can summon the members of his pirate crew one after another to perform assist attacks, each with their own strengths and uses!<br></li><li><strong>RECKLESS SAILOR</strong> - Shiverskull is great when it comes to running in and putting on the pressure — but be careful, as messing up can cost you dearly!<br></li><li><strong>MORE SWORDS</strong> - Wield a deadly Super Move that summons a ring of damaging swords around you for a short time!</li></ul><br>‎<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Black_Heart_Small.png?t=1702486813\" /><br><br>Black Heart is an alien parasite that feeds off people's inner hatred to take on their form. Having taken the form of Clyde, Black Heart inherits his speed and fire abilities, but like the trickster they are, they use those powers in much more devious ways.<br><br><ul class=\"bb_ul\"><li><strong>TRICKSTER</strong> - Black Heart is capable of all sorts of mix-ups that are extremely difficult to react to, forcing their opponents into a guessing game!<br></li><li><strong>SLIPPERY SLIME</strong> - Black Heart has some of the trickiest movement in the game, with unique dashes and special moves that let them easily dodge enemy attacks!<br></li><li><strong>HEART BREAKER</strong> - Rain terror with a Super Move that traps the opponent in a massive smoke cloud, letting you be nearly invisible as you get in their face!</li></ul><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Callowman_Small.png?t=1702486813\" /><br><br>Everyone's favourite green, legless superhero, Callowman blurs the line a bit between bravery and stupidity. But regardless of his quality as a hero, he certainly has the raw strength to warrant being called the mightiest warrior in the universe!<br><br><ul class=\"bb_ul\"><li><strong>GRAPPLING WITH EVIL</strong> - Callowman's slew of advancing grappling attacks make him extremely fearsome to fight, especially since he's no slouch on speed!<br></li><li><strong>SHOW OFF</strong> - Successfully taunting as Callowman powers up your grabbing attacks, and you can use them in combos! Now that's what I call a flex!<br></li><li><strong>ALMIGHTY POWER </strong>- One of Callowman's Super Moves, if used with a full Super Meter AND a full taunt-buff meter, can instantly KO the opponent!!</li></ul><br>‎<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Doodle_Small.png?t=1702486813\" /><br><br>The fourth-wall-breaking, two-dimensional menace, Doodle emerges from the depths of development hell to exact his revenge for all the cancelled games he was meant to star in. The first step of his vengeance quest? Breaking ALL the rules!<br><br><ul class=\"bb_ul\"><li><strong>CHARGE UP</strong> - Doodle goes against the game's normal control scheme, introducing special moves inputted with charge motions!<br></li><li><strong>METER BURNER </strong>- Unload tons of damage with a Super Move that lets you spend even more meter to increase its power!<br></li><li><strong>ULTIMATE DOODLE</strong> - Doodle also features a Super Move that lets him briefly use his charge attacks with no charge required, giving him even more damage potential!</li></ul><br>And <strong>even more characters</strong> to discover for yourself!",
    "background": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/page_bg_generated_v6b.jpg?t=1702486813",
    "background_raw": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/page.bg.jpg?t=1702486813",
    "capsule_image": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/capsule_231x87.jpg?t=1702486813",
    "capsule_imagev5": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/capsule_184x69.jpg?t=1702486813",
    "categories": [
        {
            "description": "Single-player",
            "id": 2
        },
        {
            "description": "Multi-player",
            "id": 1
        },
        {
            "description": "PvP",
            "id": 49
        },
        {
            "description": "Shared/Split Screen PvP",
            "id": 37
        },
        {
            "description": "Shared/Split Screen",
            "id": 24
        },
        {
            "description": "Full controller support",
            "id": 28
        },
        {
            "description": "Remote Play Together",
            "id": 44
        }
    ],
    "content_descriptors": {
        "ids": [
            5
        ],
        "notes": "Several characters use mild language in dialogue (e.g. damn, hell, piss, ass, crap).\r\nThere are insinuations of certain characters drinking alcohol in lore entries.\r\nThe victory animation of the skeletal character Captain Shiverskull depicts him and his crew \"drinking\" nondescript alcoholic beverages.\r\nSome characters' lore entries mention that they have performed criminal acts such as piracy, manslaughter, workplace mistreatment, and wage theft. Some are outright stated, while some are only implied.\r\nThe character Lance Marshall is shown to smoke tobacco.\r\nMultiple characters are shown to wield firearms.\r\nSome visuals in the game depict blood stains and visible wounds."
    },
    "controller_support": "full",
    "detailed_description": "<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Overview_Small.png?t=1702486813\" /><br><br>Welcome to <strong>Duels of Fortune</strong>, a fast-paced 2.5D fighting game featuring a crazy diverse cast of loveable characters with unique superpowers, and an open-ended, freeform gameplay style that lets you play the game your way. It provides a simple control scheme that makes the game accessible for beginners, while keeping plenty of mechanical and character-based depth for serious players to dig into.<br><br>From intense clashes against friends and rivals, to expansive singleplayer content, to heaps of character lore to read up on, there's something for everyone in Duels of Fortune!<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Features_Small.png?t=1702486813\" /><br>                                                                                                                                                                                  <br><ul class=\"bb_ul\"><li><strong>VERSUS MODE</strong> - Battle it out in traditional 1-on-1 duels!<br></li><li><strong>ARCADE MODE</strong> - Fight your way through a gauntlet of increasingly difficult opponents, culminating with a special boss fight!<br></li><li><strong>TRAINING MODE</strong> - Practice your skills using a customizable training dummy!<br></li><li><strong>MISSION MODE</strong> - Participate in numerous special fights that add unique challenges or conditions to spice up the match!<br></li><li><strong>BOSS FIGHTS</strong> - Easily rematch any of the unique and challenging bosses found throughout the game!<br></li><li><strong>COMBO TRIALS</strong> - Learn what each character can do by trying out increasingly tricky pre-made combos!<br></li><li><strong>STAGE HAZARDS</strong> - A toggleable feature that flips stages on their head with all sorts of crazy effects, including ring-out zones, throwable items, giant skeletons that attack you from the background, and MORE!!<br></li><li><strong>LORE JOURNAL</strong> - Read up on the lore and backstory of each character, and learn what they fight for!<br></li><li><strong>JUKEBOX </strong>- Jam out to the bangin' soundtrack composed by Jack7!<br></li><li>All with 15+ <strong>UNIQUE FIGHTERS</strong> to choose from, with many more on the way!</li></ul>                                                                                                                                                                                  <br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Mechanics_Small.png?t=1702486813\" /><br><br><ul class=\"bb_ul\"><li>Perform stylish and dynamic <strong>combos </strong>with an open-ended attack cancel system!<br></li><li>Build up your Super Meter to unleash powerful and cinematic <strong>Super Moves</strong>, or defend yourself in a pinch with invincible <strong>Reversal</strong> attacks!<br></li><li>Strategically use <strong>Break Burst</strong> to shut down your opponents' combos, or go all-in on your own combo with a well-timed <strong>Blast Burst</strong>!<br></li><li>Schmoove around the stage with a variety of <strong>mobility mechanics</strong>, including dashes, long jumps, airdashes, free air drifting, and tons of unique character-specific options!<br></li><li>Choose between <strong>two styles</strong> of blocking: button-based blocking, or back-to-block!<br></li><li>And on top of all that, explore each character's plethora of <strong>unique attributes</strong>, giving every one of them a completely distinct feel and style!</li></ul>                                                                                                                                                                                  <br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Characters_Small.png?t=1702486813\" /><br><br>What would a fighting game be without its fun and diverse cast of playable characters? Here's just a handful of the loveable (and despicable) fighters you can choose from!<br><br>‎<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Clyde_Small.png?t=1702486813\" /><br><br>Clyde is a boxing prodigy with an attitude, and one of the most renowned fighters in the world. Clyde doesn't need any weapons; his fists, his natural speed, and his ability to create fire from his hands are all he needs to put up a good fight!<br><br><ul class=\"bb_ul\"><li><strong>TRAILBLAZER</strong> - Rush in and overwhelm your opponents with Clyde's incredible speed and offensive capabilities!<br></li><li><strong>BRING THE HEAT </strong>- Clyde's special moves are focused on raw power and combo utility, delivering fiery punches left and right!<br></li><li><strong>KING OF THE RING</strong> - Keep your opponent on the ropes with fast mix-ups that force equally fast reactions!</li></ul>‎<br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Annie_Small.png?t=1702486813\" /><br><br>Annie is a young engineer with a big brain, and an even bigger heart. Using her powerful mechanical arm, her vast arsenal of gadgets, and her helpful robotic companion Gizmo, she holds her own even despite her lack of experience!<br><br><ul class=\"bb_ul\"><li><strong>GADGET GIRL </strong>- Annie's wide array of projectiles and traps let her set up an unbreakable defense, and she has the tools to easily convert her long-range zoning into close-up pressure!<br></li><li><strong>BLAST OFF</strong> - Annie's special rocket boots grant her a midair jump, as well as the ability to drastically slow her descent!<br></li><li><strong>HELPING HAND </strong>- Annie's Super Moves summon her little robo-buddy Gizmo to assist her in various ways, like firing massive lasers or carpet-bombing the whole stage!</li></ul><br>‎<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Rattlebone_Small.png?t=1702486813\" /><br><br>Long ago, Rattlebone was a royal knight who loyally served his kingdom, until one day he fell victim to a horrible trebuchet accident. Now, revived into the modern day in skeletal form, he continues to fight as honourably as ever with his trusty sword and shield!<br><br><ul class=\"bb_ul\"><li><strong>FOR HONOUR </strong>- An honest and noble fighter, Rattlebone is primarily focused on the absolute fundamentals of combat!<br></li><li><strong>RATTLE ME BONES</strong> - Rattlebone's skeletal form grants him plenty of new techniques, like throwing his own head as a bouncing projectile!<br></li><li><strong>CHIVALROUS SPIRIT</strong> - Unleash a powerful Super Move that imbues Rattlebone's sword with special properties for a limited time!</li></ul><br>‎<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Shoto_Small.png?t=1702486813\" /><br><br>Shoto is a young, yet highly skilled student of the Locks Dojo. While he may have the personality of a cardboard box, his powers of electricity and his unbreakable focus in combat make him a force to be reckoned with!<br><br><ul class=\"bb_ul\"><li><strong>GREASED LIGHTNING</strong>- Shoto's attacks are fast and precise, giving him a natural advantage in hand-to-hand combat!<br></li><li><strong>GLASS CANNON</strong> - Shoto may sport a low health pool, but he's got lots of ways to dish out far more damage in return!<br></li><li><strong>SHOTOKAN SPECIAL</strong> - With straightforward projectiles, a powerful uppercut, and a flurry of advancing kicks, Shoto remains true to his namesake while putting his own unique spin on the formula!</li></ul><br>‎<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Red_Small.png?t=1702486813\" /><br><br>A brash, delinquent punk from the Capital, Red's aggressive and brutish nature is reflected in his fighting style. Red aims to get in his opponent's face and stay there, relentlessly beating them down with his energy beam!<br><br><ul class=\"bb_ul\"><li><strong>BRUTE STRENGTH</strong> - Red is a powerful attacker who prefers to brute-force his way in, rather than relying on speed or zoning.<br></li><li><strong>UNYIELDING RAGE</strong> - Red's special Rage mechanic lets him unleash stronger versions of his special moves after taking or dealing enough damage!<br></li><li><strong>SMASHIN' KNEECAPS</strong> - Thanks to his many grappling attacks and deadly mix-ups, Red almost never has to let up his offense once he has the advantage!</li></ul>‎<br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Baron_Small.png?t=1702486813\" /><br><br>Often called the &quot;strongest man alive&quot;, Baron's overwhelming desire to fight strong opponents led him down a dark, bloody path that ended with a life sentence. Now set free again thanks to the manipulation of Sylvan Blackjack, his titanic strength and powerful grappling techniques will crush all who oppose him.<br><br><ul class=\"bb_ul\"><li><strong>WRESTLING LEGEND</strong> - Baron's mighty grappling moves can dish out damage like nothing else, and can even be comboed together under the right circumstances!<br></li><li><strong>UNBREAKABLE</strong> - With a huge HP pool and a variety of armoured attacks, Baron is both an unstoppable force, AND an immovable object!<br></li><li><strong>THE BIGGER THEY ARE...</strong> - Baron's great power comes at the cost of mobility. Use your techniques wisely to keep the opponent on the back foot and avoid getting overwhelmed!</li></ul>‎<br>‎<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Sylvan_Small.png?t=1702486813\" /><br><br>Sylvan is the founder and CEO of the Diamondeye Company, one of the largest and richest corporations in the world. Naturally, this can only mean that Sylvan is as sleazy and underhanded as they come, and he'll put all his chips down to get the job done.<br><br><ul class=\"bb_ul\"><li><strong>ACES HIGH</strong> - Sylvan revolves around his card drawing mechanic. The more Aces he draws using his card draw attacks, the more options he gains!<br></li><li><strong>FULL HOUSE</strong> - When Sylvan has all 4 aces, he enters a state called Full House mode, where he becomes the most powerful character in the game for a limited time!<br></li><li><strong>GOOD LUCK</strong> - It can take some time and luck to get to Full House mode, but tools like a slot machine that grants random effects, and your faithful bodyguard Mr. Withers, can help buy you some time.</li></ul><br>‎<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Shiverskull_Small.png?t=1702486813\" /><br><br>Once a feared high-seas pirate, Shiverskull is back from the dead to plunder the competition! With his twin swords and the help of his trusted pirate crew, he isn't afraid to take some serious risks to win. You can't kill what's already dead!<br><br><ul class=\"bb_ul\"><li><strong>AYE, MATEYS</strong> - Shiverskull can summon the members of his pirate crew one after another to perform assist attacks, each with their own strengths and uses!<br></li><li><strong>RECKLESS SAILOR</strong> - Shiverskull is great when it comes to running in and putting on the pressure — but be careful, as messing up can cost you dearly!<br></li><li><strong>MORE SWORDS</strong> - Wield a deadly Super Move that summons a ring of damaging swords around you for a short time!</li></ul><br>‎<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Black_Heart_Small.png?t=1702486813\" /><br><br>Black Heart is an alien parasite that feeds off people's inner hatred to take on their form. Having taken the form of Clyde, Black Heart inherits his speed and fire abilities, but like the trickster they are, they use those powers in much more devious ways.<br><br><ul class=\"bb_ul\"><li><strong>TRICKSTER</strong> - Black Heart is capable of all sorts of mix-ups that are extremely difficult to react to, forcing their opponents into a guessing game!<br></li><li><strong>SLIPPERY SLIME</strong> - Black Heart has some of the trickiest movement in the game, with unique dashes and special moves that let them easily dodge enemy attacks!<br></li><li><strong>HEART BREAKER</strong> - Rain terror with a Super Move that traps the opponent in a massive smoke cloud, letting you be nearly invisible as you get in their face!</li></ul><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Callowman_Small.png?t=1702486813\" /><br><br>Everyone's favourite green, legless superhero, Callowman blurs the line a bit between bravery and stupidity. But regardless of his quality as a hero, he certainly has the raw strength to warrant being called the mightiest warrior in the universe!<br><br><ul class=\"bb_ul\"><li><strong>GRAPPLING WITH EVIL</strong> - Callowman's slew of advancing grappling attacks make him extremely fearsome to fight, especially since he's no slouch on speed!<br></li><li><strong>SHOW OFF</strong> - Successfully taunting as Callowman powers up your grabbing attacks, and you can use them in combos! Now that's what I call a flex!<br></li><li><strong>ALMIGHTY POWER </strong>- One of Callowman's Super Moves, if used with a full Super Meter AND a full taunt-buff meter, can instantly KO the opponent!!</li></ul><br>‎<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/2371130/extras/DoF_Doodle_Small.png?t=1702486813\" /><br><br>The fourth-wall-breaking, two-dimensional menace, Doodle emerges from the depths of development hell to exact his revenge for all the cancelled games he was meant to star in. The first step of his vengeance quest? Breaking ALL the rules!<br><br><ul class=\"bb_ul\"><li><strong>CHARGE UP</strong> - Doodle goes against the game's normal control scheme, introducing special moves inputted with charge motions!<br></li><li><strong>METER BURNER </strong>- Unload tons of damage with a Super Move that lets you spend even more meter to increase its power!<br></li><li><strong>ULTIMATE DOODLE</strong> - Doodle also features a Super Move that lets him briefly use his charge attacks with no charge required, giving him even more damage potential!</li></ul><br>And <strong>even more characters</strong> to discover for yourself!",
    "developers": [
        "Cosmic Hat Games"
    ],
    "genres": [
        {
            "description": "Action",
            "id": "1"
        },
        {
            "description": "Indie",
            "id": "23"
        },
        {
            "description": "Early Access",
            "id": "70"
        }
    ],
    "header_image": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/header.jpg?t=1702486813",
    "is_free": true,
    "linux_requirements": [],
    "mac_requirements": [],
    "movies": [
        {
            "highlight": true,
            "id": 256984199,
            "mp4": {
                "480": "http://cdn.akamai.steamstatic.com/steam/apps/256984199/movie480.mp4?t=1701119462",
                "max": "http://cdn.akamai.steamstatic.com/steam/apps/256984199/movie_max.mp4?t=1701119462"
            },
            "name": "Duels of Fortune Trailer",
            "thumbnail": "https://cdn.akamai.steamstatic.com/steam/apps/256984199/movie.293x165.jpg?t=1701119462",
            "webm": {
                "480": "http://cdn.akamai.steamstatic.com/steam/apps/256984199/movie480_vp9.webm?t=1701119462",
                "max": "http://cdn.akamai.steamstatic.com/steam/apps/256984199/movie_max_vp9.webm?t=1701119462"
            }
        }
    ],
    "name": "Duels of Fortune",
    "package_groups": [],
    "pc_requirements": {
        "minimum": "<strong>Minimum:</strong><br><ul class=\"bb_ul\"><li><strong>OS:</strong> Windows 10<br></li><li><strong>Storage:</strong> 6 GB available space</li></ul>",
        "recommended": "<strong>Recommended:</strong><br><ul class=\"bb_ul\"><li><strong>OS:</strong> Windows 10<br></li><li><strong>Processor:</strong> Intel Core i5<br></li><li><strong>Memory:</strong> 8 GB RAM<br></li><li><strong>Storage:</strong> 6 GB available space</li></ul>"
    },
    "platforms": {
        "linux": false,
        "mac": false,
        "windows": true
    },
    "publishers": [
        "Cosmic Hat Games"
    ],
    "release_date": {
        "coming_soon": false,
        "date": "Dec 13, 2023"
    },
    "required_age": 0,
    "screenshots": [
        {
            "id": 0,
            "path_full": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/ss_709c5c3755be68a80fc5f46664fb0e110d2b6391.1920x1080.jpg?t=1702486813",
            "path_thumbnail": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/ss_709c5c3755be68a80fc5f46664fb0e110d2b6391.600x338.jpg?t=1702486813"
        },
        {
            "id": 1,
            "path_full": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/ss_b74cb3af0a2984e805a5dd0f62dc96999611d1ce.1920x1080.jpg?t=1702486813",
            "path_thumbnail": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/ss_b74cb3af0a2984e805a5dd0f62dc96999611d1ce.600x338.jpg?t=1702486813"
        },
        {
            "id": 2,
            "path_full": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/ss_98fbca5a48603f295b398541148e50e5f8efc590.1920x1080.jpg?t=1702486813",
            "path_thumbnail": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/ss_98fbca5a48603f295b398541148e50e5f8efc590.600x338.jpg?t=1702486813"
        },
        {
            "id": 3,
            "path_full": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/ss_c626341e244976cbeb866542f4ff851bd7f93339.1920x1080.jpg?t=1702486813",
            "path_thumbnail": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/ss_c626341e244976cbeb866542f4ff851bd7f93339.600x338.jpg?t=1702486813"
        },
        {
            "id": 4,
            "path_full": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/ss_b0daac310e74bd03884034698323e9030b028d86.1920x1080.jpg?t=1702486813",
            "path_thumbnail": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/ss_b0daac310e74bd03884034698323e9030b028d86.600x338.jpg?t=1702486813"
        },
        {
            "id": 5,
            "path_full": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/ss_f3079db4aa1f5b7166b96fc92a92f97b66e899e7.1920x1080.jpg?t=1702486813",
            "path_thumbnail": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/ss_f3079db4aa1f5b7166b96fc92a92f97b66e899e7.600x338.jpg?t=1702486813"
        },
        {
            "id": 6,
            "path_full": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/ss_022e2a37bacc6a6af3a5b88e821af748ee8c98f5.1920x1080.jpg?t=1702486813",
            "path_thumbnail": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/ss_022e2a37bacc6a6af3a5b88e821af748ee8c98f5.600x338.jpg?t=1702486813"
        },
        {
            "id": 7,
            "path_full": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/ss_5a1240e1a1d79b73225a17d7e529a1512ab43512.1920x1080.jpg?t=1702486813",
            "path_thumbnail": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/ss_5a1240e1a1d79b73225a17d7e529a1512ab43512.600x338.jpg?t=1702486813"
        },
        {
            "id": 8,
            "path_full": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/ss_2baf86c278b89bcb5eff0d478f986bb3fae2f34f.1920x1080.jpg?t=1702486813",
            "path_thumbnail": "https://cdn.akamai.steamstatic.com/steam/apps/2371130/ss_2baf86c278b89bcb5eff0d478f986bb3fae2f34f.600x338.jpg?t=1702486813"
        }
    ],
    "short_description": "A fast-paced, explosive fighting game with an expressive combo system and a diverse character roster! Play as superhumans, skeletal knights, aliens, and even stick figures! Battle dangerous foes, take part in lots of exciting singleplayer modes, throw your opponents into the sun, and so much more!",
    "steam_appid": 2371130,
    "support_info": {
        "email": "cosmichatgames@gmail.com",
        "url": ""
    },
    "supported_languages": "English",
    "type": "game",
    "website": null
}